[[[
"James: Here it comes!",
"Teo (singing along): Here comes the train again…",
"James: Rocking on your head like a… Wait, no, if it was rocking on your head you wouldn't even realise it, you'd be dead!"],[
"Rosie: Have you seen my slit?"],[
"Sam: Amy was flicking the switch and fingering the hole."],[
"Rosie: Shut the absolute fuck up!"],[
"Teo: My forehead was hit by a high-speed insect."],[
"Serena (unpacking her lunch): Let's see what past Serena has packed."],[
"Izzy: I like being in pain when I eat curry."],[
"Tom: What time is it?",
"Teo: Beer o'clock."],[
"Tom: Not now obviously as it's stupid o'clock at night."],[
"Serena: My hole is getting bigger."],[
"Joseph: The group report is technically written. Now it just needs to be written technically."],[
"Serena: I have severe risk of sunburning so much that I sponta­neously combust and fall off a cliff edge."],[
"// Lee tries to minimise his party smashedness",
"Teo: Lee, are you using a PID method to adjust your alcohol consumption with the passage of time?"],[
"// Tom brings a bottle of strange looking liquid to the party",
"Artur: It looks like swimming pool water…",
"Tom: It's vodka, rum, sambuca, and… some other fillers.",
"Artur (taking a sip from the bottle): And it also tastes like swimming pool water!"],[
"Dan: I can't have beer… because… it disagrees with me."],[
"Dan: ECS gets all the money in this faculty, we, physics, get nothing! Then how comes you don't have money?",
"Lee: No! We don't have any money! And you know why? Because of the conservative party, that's why!!!"],[
"Izzy: Take the fucking sausage!"],[
"Izzy: I might have to take my trousers off."],[
"Serena: Give it 10 minutes and we'll all be stripping again."],[
"Izzy: My rucksack is trying to undress me."],[
"Izzy: Ooh it's warm, sit in my bum space!"],[
"Izzy: I've never seen so much donut-related panic!"],[
"Tom: In the future… if anyone is trying to down 2 Zombies… and a 75% rum…",
"Teo: Prevent them!",
"Tom: Yes."]],

[[
"Teo: I deeply appreciate your appreciation.",
"James: Your appreciation at my appreciation is much appreciated; I appreciate that.",
"Tom: I appreciate the fact that James has appreciated Teo's appreciation at his appreciation. The committee appreciating each other is much appreciated."],[
"Byron: Something’s not quite right when Scotland of all places is being hit by a Tropical Storm."],[
"Serena: I feel like this conversation is getting a bit incestuous."],[
"James: Mind the gap between the train and the water."],[
"Izzy: You are disinvited to all socials!"],[
"Izzy: I love how they say they'll ask for ID if you look under 25 but they ask nothing…",
"Teo: Ever since I've grown a beard the probability of being asked for ID when I buy alcohol has dropped ​from 95% to 5%.",
"Izzy: Same with me, since I've grown boobs!",
"Jason: …same with me since I've grown both!"],[
"Izzy: What day is it?",
"Us: Saturday.",
"Izzy: What does that equal?"],[
"Somebody: That's disgusting.",
"James: Sex is disgusting!",
"// Everyone pulls disgusted faces",
"Teo: And we thought adding cream before jam was bad!"],[
"Teo: There is one between you and me. And please don't put that out of context!"],[
"Teo: I'm being attacked by tree branches and insects! wth is going on!"],[
"Someone: I have something hard between my legs.",
"Everyone: That's what everyone said!"],[
"Teo: There is one single stone in this whole fucking field! And I tripped over it!"],[
"Joe: Triangular loaf! It's the new model!",
"Teo: Wait, are you eating just plain bread?",
"Joe: Yes. I was in a rush this morning.",
"Matt C.: Teo, what's in the can?",
"Teo: Mac&cheese.",
"Matt C.: Cold mac&cheese?! I'd rather eat plain bread!",
"Teo: I think you fail to notice the warmth of my soul, which is warming up the mac&cheese."],[
"Jason: I wish somebody looked at me the way you look at food."],[
"Jenna: Worst British insult ever…",
"Tom: I hope your tea goes cold!"],[
"Rosie: Jenna, I don't know you well enough for this!"],[
"Serena: Who has the spare sandwiches?"],[
"Tom: If you upset your camera, it's not gonna kill you; if you upset people, they might!"],[
"Serena: We don't want any kind of exposure from Arshad!"],[
"Daisy: That's why I'm standing up: I just want to feel that death."]],

[[
"Sam: My whole leg just vanished!"],[
"Serena: There is some toilet paper, but I think it's in the other minibus.",
"Me: There is some in the toilets, but it's soggy. And there's a caterpillar in the sink, but other than that all good."],[
"Tom: It’s best if they’re going down Llanberis, ‘cause if you take mountain bikes down Cryb Goch then you’re pretty much going, ‘Please, God, strike me with thunder and lightning!’"],[
"Izzy: You know Jenna, usually you talk kind of fast. Now that you've not slept you are like the rest of us."],[
"Izzy: She's probably calling me to tell me about her mate who bailed. But I don't wanna talk about her. Because she bailed so now she's insignificant to me."],[
"James: We just finished our photo shoot with some calamities coming up and down."],[
"Teo: Thank you for sacrificing your ass for me."],[
"Rosie: Matt, you look like you're about to shove up your fingers where the sun doesn't shine!"],[
"Rosie: You have to have the balls to ask people to touch their dogs.",
"Tom: I mean, you must have the dogs to ask people to touch their balls!"],[
"Rosie: I'm such a pathetic excuse of a human being!"],[
"Jenna: …That was before people decided to screw up the government.",
"Byron: The government decided to screw up the government!"],[
"Hannah: It was Richard! Richard put it in me!"],[
"Byron: My banana's not feeling well.",
"Teo: We have a similar situation over here!",
"Richard: Ye, mine got squished in half…"],[
"Rosie: Random question: does anyone want to enter the inter society quiz soc competition? The prize is £500, and we did quite well in quiz and curry 😏😏😂😂",
"Teo: Perhaps. But don't forget my lying in bed staring at the ceiling thinking about ideal life scenarios that will never happen for the duration of the quiz is worth £501. So there you go."],[
"Exasperated pedestrian observing us: How many millions of them are there?!"],[
"Hannah: You've got mud on your fluffy bits."],[
"Rosie: Ah! … … Oooh, ohohohoooh, I nearly died! … I slipped on a rogue bit of mud!"],[
"Rosie: As normal, my boobs are falling out."],[
"Teo: It wasn’t painful for me, but it was for the shoe."],[
"Richard: …We could go back to my place where I have 3 bottles! Well, it's only 3, but one's Absinthe so that's 2 people dead."
]],

[["James: Right, a post has been made. When I'm in a writing mood, telling me 'don't write much' ain't gonna' cut the mustard."
],["Richard: It's not like that time when we went to bloody Winchester, and none of the Chinese people had brought any lunch with them, but my food was eaten by a dog so it didn't matter anyway."
],["Richard: Left, right?"
,"Teo: When left isn't right, right is all that's left."
],["James: The spaces will go on a first come, first serve basis, so the first four people who respond to this post and say they'd like to come in my car can do so. If a fifth person wants to take refuge in the boot, or be strapped to the roof...sorry, you'll upset the weight balance of the car; I can't allow that."
],["Rosie: At least I’m retarded."
],["Serena: He was apologising profusely."
],["Harry: I like my women like I like my walking sticks: thin and lifeless."
],["James: My backside took a pounding."
],["Rosie: We thoroughly enjoyed having you as our children this year. There are adoption sheets by the exit door."],[
"// Rosie laughs hard",
"Teo: What's the joke?",
"Rosie: We're playing where's the nipple!",
"Teo: That's a very… very intrusive game."],[
"Teo: Thank you, Richard's shoelaces, for allowing us the opportunity to overtake him."],[
"Ordinary people: No pain, no gain.",
"Hillwalkers: No hill, no meal!"],[
"Richard: This path looks like it's falling over the edge!… And, if you look over the cliff edge, you can see last year's Walking team."],[
"Teo (shutting the minibus door): Aaah! I just slapped my ass with the door."],[
"Rosie: I've done diabolically, last year my results couldn't even be numerically classified. It's like Winston Churchill said: if you're going through hell, just keep going."],[
"Izzy: It's arctic winds, let's go back home!"
],["Matt R: I spy with my little eye something beginning with R.",
"…",
"Richard: Richard!",
"Matt R: Correct.",
"Richard: Yes!",
"Matt R: You had to look deep within yourself to find the answer."]],

[[
"Serena: Tom, have you got all the German and the Polish together in the same minibus?"],[
"// Rosie and Teo try to squeeze objects into a tiny backpack pocket",
"Teo: Oh! That's bigger than I thought!",
"Both: That's what she said!!!",
"// Both laugh deadlily"],[
"Rosie: Oh no… It's dripping everywhere!"],[
"Rosie: You have to suck a bit hard…",
"Byron: Yea, it takes a bit of effort."],[
"Byron: Rosie was very wet in the minibus."],[
"Teo: Falling asleep at the back of the minibus and then waking up to that laughter is the last thing you'd want to happen with your life!"],[
"Sam: But you'd be dead surrounded by this beautiful nature!"],[
"Rosie: Is Shaun down?",
"Teo: No, he's above you."],[
"Byron: Don't fall off, 'cause we need you for the drive back."],[
"Byron: Now I gotta rush in and hopefully not push you off the mountain."],[
"Nick: Bon appetit!",
"Teo: Poftă bună!",
"Matt R.: Eat up you little shit!"],[
"Matt R.: How do you differentiate between minibus required attendees and others?",
"Izzy: Because others are fast. If you don't want bus sign up slow"],[
"Tom: I woke up at half 3 because I was sneezing too much to sleep."],[
"Sam: Is Byron with you? We haven't got Byron… We also haven't got space for Byron!"],[
"Hannah: Rosie. Confusing people since 1996."],[
"Chris: Mirrors in changing rooms always cut my head off. If I wanna try on a hat I can't see how I look like with the hat."],[
"Rosie: Mountains aren't just funny. They're hill areas 😂😂😂😂"],[
"Byron: This weekend has been a gold mine for quotes!"],[
"Hannah: Why is everybody bullying me?",
"Rosie: Because you take it so well!"],[
"Richard: Let's not get ahead of ourselves here."],[
"Richard: Those windows look like they open; and if they don't, they probably break."],[
"Shaun: If a burger comes that has an extra burger and onion rings, it's for me."],[
"Thomas: If it's a sign in a red circle, it means don't do it.",
"Harry: What if it's a duck in a circle?",
"Teo: It meas don't be a duck. If you sexually identify with a duck, don't go this way."],[
"Richard: Is it lunch yet?"],[
"Richard: Repositioning is always painful."],[
"Richard: What are the philosophical underpinnings of this statement?"],[
"Richard: Wicked!"],[
"Matt R.: We have a special offer: buy one minibus, get a Richard free."],[
"Rosie: I'm loving this walk so far. We're not doing anything!"],[
"Rosie: I have a bone to pick with you."],[
"Rosie: Oh, mud! Oh, home! This is great!"]],

[[
"// Richard's phone beeps",
"Richard: Oh great, something happened!"],[
"Teo: Your t-shirt is wrong.",
"Rosie: Your life is wrong!"],[
"Matt R: We're walking to the spire! It's something to aspire to."],[
"Shaun: Would anyone be up for going to Popworld tomorrow night?",
"Serena: Think you've double booked yourself there 😛"],[
"Caro: I know this, it's... The best song in the world.",
"Tom&Teo: No! This is just a tribute!"],[
"Gabrielle: We're trying to go in and out here, in and out, in and out."],[
"Lee (summarising ticks): Little bastards, aren't they!"],[
"James: Despite Mother Nature's apparent vaping problem for most of the day, some stunning scenery was observed."],[
"Lee: It would look rather graphic, but it would work."],[
"Izzy: Can you see the cloud, Tom? Can you see where the cloud ends?"
],["Teo: I'm psychically tired."
],["Anon1: What is Tom's problem?",
"Anon2: Which one?"
],["Teo: How many different versions of Chandelier are there?",
"Rosie: Many.",
"Matt D.: Not enough!"
],["Matt D.: I thought you weren't coming.",
"James: I wasn't going to, but then I thought, what the hell am I doing?!"
],["Hannah: I'm a bit scared for the table…",
"Teo: I'm a bit scared for the lamp!"
],["Rosie: I broke the knob.",
"We: How?!",
"Rosie: I was a little too violent!"
],["Izzy: Oh my God, it is snowing! It's like the bodies of the people after Hiroshima!"
],["Hannah: It's quite small, it's like, a square big."
],["Richard: If you miss the train, you're bollocksed."
]],

[["Richard: Bloody hellfire!"
],["Teo: But then you'll get 30 Chinese students – is that what you want?",
"Richard: Well, no, 'cause quality is better than quantity."
],["Nan Zhou: It's such a nice cream!"
],["Nan Zhou: I like everything ginger-flavoured.",
"// Richard suppresses his remarks at the sight of an underage ginger girl next to us"
],["Richard: I'm sure I ate dog, but I'm not 100% sure."
],["Nan Zhou: You bought me a gay ice cream!!!"
],["Richard: That's a picture you should take a photo of!"
],["Serena: I have some announcements to make! Firstly, there are two donuts left if anyone wants them."
],["Serena: You'll know when I'm lost because I'll give the map to someone else."
],["Richard: That group was led by Byron, we basically ran up the mountain like the SAS."
],["Serena: 6.30. But I had to shave my legs."
],["Byron: I don't melt when I touch the sun!"
],["[Sudden noise behind us]",
"Richard: Obviously the Chinese people saw a dog and they were feeling hungry so…"
],["Serena: Byron, which way is best to go now?",
"Byron: It depends which way you wanna go.",
"Richard: Maximum level sass!"
],["Serena: Sadly, I am a democratic leader."
],["Richard: Serena, I need approval for some socials: every Monday is gonna be a film night; Tuesday, Sprinkles or meal out; Wednesday, barbecue; Thursday, night out to Oceana, or another club; Friday, games night; Saturday we walk; and Sunday is a day off. For the next 8 weeks."
]],

[["Matt R.: What's the energy drink?",
"Richard: It's an apple thing and… basically cancer in a bottle."
],["Richard: Aaah! I hit the ground instead of the ball!",
"Matt R.: You still hit the ball. Just a… very big ball."
],["Teo: Look what you've produced! Look what you've caused to happen in society!!!"
],["Richard: […] it kicked in at one in the evening.",
"Teo: What is one in the evening?!",
"Richard: One in the morning."
],["Richard: The chances are so underoverwhelmingly small."
],["Serena (pointing towards the largest cow ever): Oh look, a sheep!"
],["Richard: I hear giggles! I hear you smiling!"
],["Richard: This is Hong Kong Mahjongg. Next time maybe I'm gonna teach you Chinese Hong Kong."
],["James: Is it still morning?",
"Richard: What are you on, we got the train at 2pm."
],["Serena: That is a well trimmed hedge."
],["James: I wish I had Google so I could cheat on this made up game."
],["Thomas: That's not the way unless you're mad!"
],["Serena: Don't go too far! Stay within earshot… or… megaphone shot!"
],["Serena: If you follow me and Matt, we will take you over to a better place to stand.",
"Nick: A place that isn't Yarmouth?"
],["Rosie: Sorry, sorry, sorry! Can I squidge?"
],["Dev: Magnifucking magnifying…",
"Teo: Magnifucking glass!"
],["Dev: Let's take the picture facing that way.",
"Teo: That'll be against the sun and we'll be in the shade! Our faces will be black! Well, yours is already.",
"Dev: Casual racism, I like it."
],["Yao: Richard is amazing!",
"Teo: I'm sorry, that doesn't qualify for the Quotes Collection.",
"Yao: But it's a stupid thing to say.",
"Richard: So much negativity!!!"
],["Teo: It was a discount version of the Millionaire shortbread. A thousandaire shortbread."
]],

[["Teo: They could be coming out multiple holes."
],["Thomas: The viaduct cycle path is down the river. The river is also down the river."
],["Thomas: This is the statue of Alfred the Great, the only English king with Great in his name, because he was great! He stopped the Vikings from invading England and turning it into a massive Lego manufacturing plant."
],["Teo: It's like there's an unhinged hinge inside myself. I don't know how that works.",
"Harry: Strange foreign acupuncture."
],["Thomas: We're doing a circular walk. Well… balloon-shaped."
],["Harry: Thomas put his tracker on me so he knows where I am at all times.",
"Thomas: I know where he is at all times.",
"Serena: You'll be whipped!"
],["Sign: Deer management program.",
"Joe: Too many deer?",
"Someone: Oh dear!"
],["Teo: Pardon my bottle."
],["Serena: We're getting really close to the pub now.",
"Nick: I can smell the beer!"
],["Harry: Ground Control to major Thomas, we are at the top of the hill."
],["Serena: It's not that I forget that we have Nick, it's just that I forget how o… I forget your age."
]],


[["Serena: Wow it's so bright out here!"
],["// Field full of sheep",
"Serena: Ohhhh Doggies!"
],["Thomas: The sun is supposed to be off.",
"Walker 1: The moon is crazy bright though.",
"Walker 2: You know that’s actually sunlight!"
],["Teo: Now we have a great incentive to walk ahead of the person appointed to be at the front of the group."
],["Harry: We're immigrants!"
],["Joe: And the dawn chorus has arrived! Right on cue! Quarter to six!"
],["Joe: I hear traffic!"
],["Yao: Now I'm interested in seeing the walkie talkie, but that's probably too personal to ask"
],["Harry: That doesn't make any sense. That's youth talk!"
],["Thomas: Hello! Bench, bench, bench, choose a pick."
],["Natasha: Have all of it; just don't eat upwind of Izzy."
],["Izzy: That more likely would have been a cow than a Spitfire!"
],["Jenna: I've never seen something that tastes more artificial in my whole life!"
],["James: Wait, there's a Frozen musical?! Why does that not surprise me."
],["James: You don't need ID to drink if you don't drink."
],["Thomas: Antiquitated"
],["Tom D.: A year's worth of condoms […] A lifetime supply of life insurance!"
],["Matt C.: I've no idea if she recognised me or she just said “Hi” out of sheer New Forest friendliness."
],["Geography student: *Exists*",
"Bad jokers: Go colour in.",
"Will: Crayola!"
],["Natasha: Will's life expectancy will be dramatically decreased in the next minute."
],["Will: It's just a song.",
"?: Sing it.",
"Will: I don't know the rest of it!",
"?: Then what's the point in starting?"
],["Thomas: We're also here. We have one free space. Far left, furthest perpendicular to the bar."
],["Matt C.: More mud? I didn't sign up for this!",
"Teo: I think when you signed up there was some text in 6pt font saying Size of mud may vary from the one in the picture."
]],


[["Matt C.: If anyone doesn't have lunch or water, say now.",
"Ben: I don't have walking boots, lunch, water, a coat,…",
"Matt C.: Well, you're just lost!",
"Ben: I don't have a Walkie talkie as well.",
"Matt C.: Neither do I!"
],["Tash: Can I have it any time I want? Like an ongoing present?"
],["Matt C.: Big toe? Little toe?",
"Tom D.: Second to little."
],["Me: First you got a pizza. I went to the toilet; when I was back, the pizza was gone. Then you got nachos. I went to get a pint; when I came back the nachos were gone!"
],["Mahmoud: Who would like to be the most responsible person between you three?",
"Simon: What do you mean between me three?"
],["Simon: As the shepherd says, let's get the flock out of here!"
],["Simon: Do you want a cube of brownie?",
"Matt D.: Is that organic brownie?",
"Simon: You might find that it's orgasmic brownie!"
],["Simon: I have a snow shovel so you can dig yourself as deep as you want […] in innuendo."
],["Simon: I made a snow angel.",
"Mahmoud: I almost became a snow angel!"
],["Mahmoud: You don't get involved with day walks, but do with my trip?!",
"Thomas: Because day walk secretaries don't require my help; you do!"
],["Simon: The best part is when they kiss and make up! […] Now with that prospect in mind, would you like to continue the discussion? In the same vein?"
],["James: Has anyone seen the green milk?"
],["Mahmoud: This used to be my plate before it became a rubbish bin."
],["Simon: Yes!!! I win at life!"
],["Mahmoud: Would anyone like to leave my scrambled eggs and eat some sad three days old waffle?"
],["Simon: 45 minutes of faff later, the munro team left."
],["Will: Matthew! Stop petting the devils and come over!"
],["// Imaginary motorised prams",
  "Will: Imagine the one with the [expensive] pram: “I'm gonna score all the hot girls!”",
  "Matt D.: Or all the hot babes!"
],["Will: Vegetarians! You're not you when you're hungry. Eat your meat!"
],["// Cows",
  "Will: Can we get them to mooove?"
],["Thomas: He's got a fanclub!",
  "Mahmoud: I wouldn't put up with that for long!"
],["Me: Oh look, mini railway!",
  "Tom D.: You could say we're on the right track."
],["Anon: It's okay, we can blame Teo, he's not here."


]]]
