[[
"James: Here it comes!",
"Teo (singing along): Here comes the train again…",
"James: Rocking on your head like a… Wait, no, if it was rocking on your head you wouldn't even realise it, you'd be dead!"],[
"Rosie: Have you seen my slit?"],[
"Sam: Amy was flicking the switch and fingering the hole."],[
"Rosie: Shut the absolute fuck up!"],[
"Teo: My forehead was hit by a high-speed insect."],[
"Serena (unpacking her lunch): Let's see what past Serena has packed."],[
"Izzy: I like being in pain when I eat curry."],[
"Tom: What time is it?",
"Teo: Beer o'clock."],[
"Tom: Not now obviously as it's stupid o'clock at night."],[
"Serena: My hole is getting bigger."],[
"Joseph: The group report is technically written. Now it just needs to be written technically."],[
"Serena: I have severe risk of sunburning so much that I sponta­neously combust and fall off a cliff edge."],[
"[Lee tries to minimise his party smashedness]",
"Teo: Lee, are you using a PID method to adjust your alcohol consumption with the passage of time?"],[
"[Tom brings a bottle of strange looking liquid to the party]",
"Artur: It looks like swimming pool water…",
"Tom: It's vodka, rum, sambuca, and… some other fillers.",
"Artur (taking a sip from the bottle): And it also tastes like swimming pool water!"],[
"Dan: I can't have beer… because… it disagrees with me."],[
"Dan: ECS gets all the money in this faculty, we, physics, get nothing! Then how comes you don't have money?",
"Lee: No! We don't have any money! And you know why? Because of the conservative party, that's why!!!"],[
"Izzy: Take the fucking sausage!"],[
"Izzy: I might have to take my trousers off."],[
"Serena: Give it 10 minutes and we'll all be stripping again."],[
"Izzy: My rucksack is trying to undress me."],[
"Izzy: Ooh it's warm, sit in my bum space!"],[
"Izzy: I've never seen so much donut-related panic!"],[
"Tom (drunk): In the future… if anyone is trying to down 2 Zombies… and a 75% rum…",
"Teo: Prevent them!",
"Tom: Yes."],[
"Teo: I deeply appreciate your appreciation.",
"James: Your appreciation at my appreciation is much appreciated; I appreciate that.",
"Tom: I appreciate the fact that James has appreciated Teo's appreciation at his appreciation. The committee appreciating each other is much appreciated."],[
"Byron: Something’s not quite right when Scotland of all places is being hit by a Tropical Storm."],[
"Serena: I feel like this conversation is getting a bit incestuous."],[
"James: Mind the gap between the train and the water."],[
"Izzy: You are disinvited to all socials!"],[
"Izzy: I love how they say they'll ask for ID if you look under 25 but they ask nothing…",
"Teo: Ever since I've grown a beard the probability of being asked for ID when I buy alcohol has dropped ​from 95% to 5%.",
"Izzy: Same with me, since I've grown boobs!",
"Jason: …same with me since I've grown both!"],[
"Izzy: What day is it?",
"Us: Saturday.",
"Izzy: What does that equal?"],[
"Somebody: That's disgusting.",
"James: Sex is disgusting!",
"[Everyone pulls disgusted faces]",
"Teo: And we thought adding cream before jam was bad!"],[
"Teo: There is one between you and me. And please don't put that out of context!"],[
"Teo: I'm being attacked by tree branches and insects! wth is going on!"],[
"Someone: I have something hard between my legs.",
"Everyone: That's what everyone said!"],[
"Teo: There is one single stone in this whole fucking field! And I tripped over it!"],[
"Joe: Triangular loaf! It's the new model!",
"Teo: Wait, are you eating just plain bread?",
"Joe: Yes. I was in a rush this morning.",
"Matt: Teo, what's in the can?",
"Teo: Mac&cheese.",
"Matt: Cold mac&cheese?! I'd rather eat plain bread!",
"Teo: I think you fail to notice the warmth of my soul, which is warming up the mac&cheese."],[
"Jason: I wish somebody looked at me the way you look at food."],[
"Jenna: Worst British insult ever…",
"Tom: I hope your tea goes cold!"],[
"Rosie: Jenna, I don't know you well enough for this!"],[
"Serena: Who has the spare sandwiches?"],[
"Tom: If you upset your camera, it's not gonna kill you; if you upset people, they might!"],[
"Serena: We don't want any kind of exposure from Arshad!"],[
"Daisy: That's why I'm standing up: I just want to feel that death."],[
"Sam: My whole leg just vanished!"],[
"Serena: There is some toilet paper, but I think it's in the other minibus.",
"Me: There is some in the toilets, but it's soggy. And there's a caterpillar in the sink, but other than that all good."],[
"Tom: It’s best if they’re going down Llanberis, ‘cause if you take mountain bikes down Cryb Goch then you’re pretty much going, ‘Please, God, strike me with thunder and lightning!’"],[
"Izzy: You know Jenna, usually you talk kind of fast. Now that you've not slept you are like the rest of us."],[
"Izzy: She's probably calling me to tell me about her mate who bailed. But I don't wanna talk about her. Because she bailed so now she's insignificant to me."],[
"James: We just finished our photo shoot with some calamities coming up and down."],[
"Teo: Thank you for sacrificing your ass for me."],[
"Rosie: Matt, you look like you're about to shove up your fingers where the sun doesn't shine!"],[
"Rosie: You have to have the balls to ask people to touch their dogs.",
"Tom: I mean, you must have the dogs to ask people to touch their balls!"],[
"Rosie: I'm such a pathetic excuse of a human being!"]]
